/* eslint-disable max-len */
import * as PS from './pali-script';

const testCases = [
    {
        lang: PS.Script.HI,
        langStr:
            'अ आ इ ई उ ऊ ए ओ क् ख् ग् घ् ङ् च् छ् ज् झ् ञ् ट् ठ् ड् ढ् ण् त् थ् द् ध् न् प् फ् ब् भ् म् य् र् ल् व् स् ह् ळ् ं ० १ २ ३ ४ ५ ६ ७ ८ ९ ०',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.RO,
        langStr:
            'A ā i ī u ū e o k kh g gh ṅ c ch j jh ñ ṭ ṭh ḍ ḍh ṇ t th d dh n p ph b bh m y r l v s h ḷ ṃ 0 1 2 3 4 5 6 7 8 9 0',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.THAI,
        langStr:
            'อ อา อิ อี อุ อู เอ โอ กฺ ขฺ คฺ ฆฺ งฺ จฺ ฉฺ ชฺ ฌฺ ฺ ฏฺ ฺ ฑฺ ฒฺ ณฺ ตฺ ถฺ ทฺ ธฺ นฺ ปฺ ผฺ พฺ ภฺ มฺ ยฺ รฺ ลฺ วฺ สฺ หฺ ฬฺ ํ ๐ ๑ ๒ ๓ ๔ ๕ ๖ ๗ ๘ ๙ ๐',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    // TODO: https://github.com/Path-Nirvana-Foundation/pali-script-converter/issues/2
    // {
    //     lang: PS.Script.LAOS,
    //     langStr:
    //         'ອ ອາ ອິ ອີ ອຸ ອູ ອເ ອໂ \u0ECD ະ \u0EBA ໐ ໑ ໒ ໓ ໔ ໕ ໖ ໗ ໘ ໙ ກ ຂ ຄ \u0E86 ງ ຈ \u0E89 ຊ \u0E8C \u0E8E \u0E8F \u0E90 \u0E91 \u0E92 \u0E93 ຕ ຖ ທ \u0E98 ນ ປ ຜ ພ \u0EA0 ມ ຍ ຣ ລ \u0EAC ວ ສ ຫ າ \u0EB4 \u0EB5 \u0EB8 \u0EB9 ເ ໂ',
    //     siStr:
    //         'අ ආ ඉ ඊ උ ඌ එ ඔ ං ඃ ් 0 1 2 3 4 5 6 7 8 9 ක ඛ ග ඝ ඞ ච ඡ ජ ඣ ඤ ට ඨ ඩ ඪ ණ ත ථ ද ධ න ප ඵ බ භ ම ය ර ල ළ ව ස හ ා ි ී ු ූ ෙ ො',
    // },
    {
        lang: PS.Script.MY,
        langStr:
            'အ အာ ဣ ဤ ဥ ဦ ဧ ဩ က္ ခ္ ဂ္ ဃ္ င္ စ္ ဆ္ ဇ္ ဈ္ ဉ္ ဋ္ ဌ္ ဍ္ ဎ္ ဏ္ တ္ ထ္ ဒ္ ဓ္ န္ ပ္ ဖ္ ဗ္ ဘ္ မ္ ယ္ ရ္ လ္ ဝ္ သ္ ဟ္ ဠ္ ံ ၀ ၁ ၂ ၃ ၄ ၅ ၆ ၇ ၈ ၉ ၀',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.KM,
        langStr:
            'អ អា ឥ ឦ ឧ ឩ ឯ ឱ ក្ ខ្ គ្ ឃ្ ង្ ច្ ឆ្ ជ្ ឈ្ ញ្ ដ្ ឋ្ ឌ្ ឍ្ ណ្ ត្ ថ្ ទ្ ធ្ ន្ ប្ ផ្ ព្ ភ្ ម្ យ្ រ្ ល្ វ្ ស្ ហ្ ឡ្ ំ ០ ១ ២ ៣ ៤ ៥ ៦ ៧ ៨ ៩ ០',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.BENG,
        langStr:
            'অ আ ই ঈ উ ঊ এ ও ক্ খ্ গ্ ঘ্ ঙ্ চ্ ছ্ জ্ ঝ্ ঞ্ ট্ ঠ্ ড্ ঢ্ ণ্ ত্ থ্ দ্ ধ্ ন্ প্ ফ্ ব্ ভ্ ম্ য্ র্ ল্ ৰ্ স্ হ্ ল়্ ং ০ ১ ২ ৩ ৪ ৫ ৬ ৭ ৮ ৯ ০',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.GURM,
        langStr:
            'ਅ ਆ ਇ ਈ ਉ ਊ ਏ ਓ ਕ੍ ਖ੍ ਗ੍ ਘ੍ ਙ੍ ਚ੍ ਛ੍ ਜ੍ ਝ੍ ਞ੍ ਟ੍ ਠ੍ ਡ੍ ਢ੍ ਣ੍ ਤ੍ ਥ੍ ਦ੍ ਧ੍ ਨ੍ ਪ੍ ਫ੍ ਬ੍ ਭ੍ ਮ੍ ਯ੍ ਰ੍ ਲ੍ ਵ੍ ਸ੍ ਹ੍ ਲ਼੍ ਂ ੦ ੧ ੨ ੩ ੪ ੫ ੬ ੭ ੮ ੯ ੦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    // TODO: https://github.com/Path-Nirvana-Foundation/pali-script-converter/issues/2
    // {
    //   lang: PS.Script.THAM,
    //   langStr: 'ᩋ ᩌ ᩍ ᩎ ᩏ ᩐ ᩑ ᩒ ᨠ᩠ ᨡ᩠ ᨣ᩠ ᨥ᩠ ᨦ᩠ ᨧ᩠ ᨨ᩠ ᨩ᩠ ᨫ᩠ ᨬ᩠ ᨭ᩠ ᨮ᩠ ᨯ᩠ ᨰ᩠ ᨱ᩠ ᨲ᩠ ᨳ᩠ ᨴ᩠ ᨵ᩠ ᨶ᩠ ᨸ᩠ ᨹ᩠ ᨻ᩠ ᨽ᩠ ᨾ᩠ ᨿ᩠ ᩁ᩠ ᩃ᩠ ᩅ᩠ ᩈ᩠ ᩉ᩠ ᩊ᩠ ᩴ ᪐ ᪑ ᪒ ᪓ ᪔ ᪕ ᪖ ᪗ ᪘ ᪙ ᪐',
    //   siStr: 'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    // },
    {
        lang: PS.Script.GUJA,
        langStr:
            'અ આ ઇ ઈ ઉ ઊ એ ઓ ક્ ખ્ ગ્ ઘ્ ઙ્ ચ્ છ્ જ્ ઝ્ ઞ્ ટ્ ઠ્ ડ્ ઢ્ ણ્ ત્ થ્ દ્ ધ્ ન્ પ્ ફ્ બ્ ભ્ મ્ ય્ ર્ લ્ વ્ સ્ હ્ ળ્ ં ૦ ૧ ૨ ૩ ૪ ૫ ૬ ૭ ૮ ૯ ૦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.TELU,
        langStr:
            'అ ఆ ఇ ఈ ఉ ఊ ఏ ఓ క్ ఖ్ గ్ ఘ్ ఙ్ చ్ ఛ్ జ్ ఝ్ ఞ్ ట్ ఠ్ డ్ ఢ్ ణ్ త్ థ్ ద్ ధ్ న్ ప్ ఫ్ బ్ భ్ మ్ య్ ర్ ల్ వ్ స్ హ్ ళ్ ం ౦ ౧ ౨ ౩ ౪ ౫ ౬ ౭ ౮ ౯ ౦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.KANN,
        langStr:
            'ಅ ಆ ಇ ಈ ಉ ಊ ಏ ಓ ಕ್ ಖ್ ಗ್ ಘ್ ಙ್ ಚ್ ಛ್ ಜ್ ಝ್ ಞ್ ಟ್ ಠ್ ಡ್ ಢ್ ಣ್ ತ್ ಥ್ ದ್ ಧ್ ನ್ ಪ್ ಫ್ ಬ್ ಭ್ ಮ್ ಯ್ ರ್ ಲ್ ವ್ ಸ್ ಹ್ ಳ್ ಂ ೦ ೧ ೨ ೩ ೪ ೫ ೬ ೭ ೮ ೯ ೦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.MALA,
        langStr:
            'അ ആ ഇ ഈ ഉ ഊ ഏ ഓ ക് ഖ് ഗ് ഘ് ങ് ച് ഛ് ജ് ഝ് ഞ് ട് ഠ് ഡ് ഢ് ണ് ത് ഥ് ദ് ധ് ന് പ് ഫ് ബ് ഭ് മ് യ് ര് ല് വ് സ് ഹ് ള് ം ൦ ൧ ൨ ൩ ൪ ൫ ൬ ൭ ൮ ൯ ൦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.BRAH,
        langStr:
            '𑀅 𑀆 𑀇 𑀈 𑀉 𑀊 𑀏 𑀑 𑀓𑁆 𑀔𑁆 𑀕𑁆 𑀖𑁆 𑀗𑁆 𑀘𑁆 𑀙𑁆 𑀚𑁆 𑀛𑁆 𑀜𑁆 𑀝𑁆 𑀞𑁆 𑀟𑁆 𑀠𑁆 𑀡𑁆 𑀢𑁆 𑀣𑁆 𑀤𑁆 𑀥𑁆 𑀦𑁆 𑀧𑁆 𑀨𑁆 𑀩𑁆 𑀪𑁆 𑀫𑁆 𑀬𑁆 𑀭𑁆 𑀮𑁆 𑀯𑁆 𑀲𑁆 𑀳𑁆 𑀴𑁆 𑀁 𑁦 𑁧 𑁨 𑁩 𑁪 𑁫 𑁬 𑁭 𑁮 𑁯 𑁦',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.TIBT,
        langStr:
            'ཨ ཨཱ ཨི ཨཱི ཨུ ཨཱུ ཨེ ཨོ ཀ྄ ཁ྄ ག྄ གྷ྄ ང྄ ཙ྄ ཚ྄ ཛ྄ ཛྷ྄ ཉ྄ ཊ྄ ཋ྄ ཌ྄ ཌྷ྄ ཎ྄ ཏ྄ ཐ྄ ད྄ དྷ྄ ན྄ པ྄ ཕ྄ བ྄ བྷ྄ མ྄ ཡ྄ ར྄ ལ྄ ཝ྄ ས྄ ཧ྄ ལ྄༹ ཾ ༠ ༡ ༢ ༣ ༤ ༥ ༦ ༧ ༨ ༩ ༠',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
    {
        lang: PS.Script.CYRL,
        langStr:
            'а а̄ и ӣ у ӯ е о к кх г гх н̇ ч чх дж джх н̃ т̣ т̣х д̣ д̣х н̣ т тх д дх н п пх б бх м й р л в с х л̣ м̣ 0 1 2 3 4 5 6 7 8 9 0',
        siStr:
            'අ ආ ඉ ඊ උ ඌ එ ඔ ක් ඛ් ග් ඝ් ඞ් ච් ඡ් ජ් ඣ් ඤ් ට් ඨ් ඩ් ඪ් ණ් ත් ථ් ද් ධ් න් ප් ඵ් බ් භ් ම් ය් ර් ල් ව් ස් හ් ළ් ං 0 1 2 3 4 5 6 7 8 9 0',
    },
];

describe('check conversion to SI', () => {
    testCases.forEach(({ lang, langStr, siStr }) => {
        it(`from ${lang}`, () => {
            const actual = PS.TextProcessor.convertFrom(langStr, lang);
            expect(actual).toEqual(siStr);
        });
    });
});

describe('check conversion from SI', () => {
    testCases.forEach(({ lang, langStr, siStr }) => {
        it(`to ${lang}`, () => {
            const actual = PS.TextProcessor.convert(siStr, lang);
            expect(actual).toEqual(langStr);
        });
    });
});
